# SlopeDegree Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..SlopeDegree Property
SymbolTypeId Class See Also
---
Symbol °, indicating unit Slope degrees.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SlopeDegree { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlopeDegree As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlopeDegree {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace